RT-Thread/rt-thread/bsp/n32g45x/Libraries/n32g45x_std_periph_driver/n32g45x_std_driver/src/n32g45x_eth.c
/*****************************************************************************
 * Copyright (c) 2019, Nations Technologies Inc.
 *
 * All rights reserved.
 * ****************************************************************************
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the disclaimer below.
 *
 * Nations' name may not be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * DISCLAIMER: THIS SOFTWARE IS PROVIDED BY NATIONS "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * DISCLAIMED. IN NO EVENT SHALL NATIONS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * ****************************************************************************/

/**
 * @file n32g45x_eth.c
 * @author Nations Solution Team
 * @version v1.0.0
 *
 * @copyright Copyright (c) 2019, Nations Technologies Inc. All rights reserved.
 */
#include "n32g45x_eth.h"
#include "n32g45x_gpio.h"

/** @addtogroup N32G45X_StdPeriph_Driver
 * @{
 */

/** @addtogroup ETH
 * @brief ETH driver modules
 * @{
 */

/**
 * @brief Initialize GPIO pins for MII/RMII interface.
 *
 * @param ETH_Interface specifies the interface, can be the following values:
 *  @arg ETH_INTERFACE_RMII Reduced media-independent interface
 *  @arg ETH_INTERFACE_MII Media-independent interface
 * @param remap remap mode, can be 0~3
 */
void ETH_ConfigGpio(uint8_t ETH_Interface, uint8_t remap)
{
    GPIO_InitType GPIO_InitStructure;
    uint32_t ETH_PA_O;
    uint32_t ETH_PA_I;
    uint32_t ETH_PB_O;
    uint32_t ETH_PB_I;
    uint32_t ETH_PC_O;
    uint32_t ETH_PC_I;
    uint32_t ETH_PD_O;
    uint32_t ETH_PD_I;
    if (ETH_Interface == ETH_INTERFACE_MII)
    {
        switch (remap)
        {
        case 0:
            ETH_PA_O = GPIO_PIN_2;
            ETH_PA_I = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_3 | GPIO_PIN_7;
            ETH_PB_O = GPIO_PIN_8 | GPIO_PIN_11 | GPIO_PIN_12 | GPIO_PIN_13;
            ETH_PB_I = GPIO_PIN_10 | GPIO_PIN_0 | GPIO_PIN_1;
            ETH_PC_O = GPIO_PIN_1 | GPIO_PIN_2;
            ETH_PC_I = GPIO_PIN_3 | GPIO_PIN_4 | GPIO_PIN_5;
            ETH_PD_O = 0;
            ETH_PD_I = 0;
            break;
        case 1:
            ETH_PA_O = GPIO_PIN_2;
            ETH_PA_I = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_3;
            ETH_PB_O = GPIO_PIN_8 | GPIO_PIN_11 | GPIO_PIN_12 | GPIO_PIN_13;
            ETH_PB_I = GPIO_PIN_10;
            ETH_PC_O = GPIO_PIN_1 | GPIO_PIN_2;
            ETH_PC_I = GPIO_PIN_3;
            ETH_PD_O = 0;
            ETH_PD_I = GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12;
            GPIO_ConfigPinRemap(GPIO_RMP1_ETH, ENABLE);
            break;
        case 2:
            ETH_PA_O = GPIO_PIN_2;
            ETH_PA_I = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_3 | GPIO_PIN_7;
            ETH_PB_O = GPIO_PIN_7 | GPIO_PIN_11 | GPIO_PIN_12 | GPIO_PIN_13;
            ETH_PB_I = GPIO_PIN_10 | GPIO_PIN_0 | GPIO_PIN_1;
            ETH_PC_O = GPIO_PIN_1 | GPIO_PIN_2;
            ETH_PC_I = GPIO_PIN_3 | GPIO_PIN_4 | GPIO_PIN_5;
            ETH_PD_O = 0;
            ETH_PD_I = 0;
            GPIO_ConfigPinRemap(GPIO_RMP2_ETH, ENABLE);
            break;
        case 3:
            ETH_PA_O = GPIO_PIN_2;
            ETH_PA_I = GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_3;
            ETH_PB_O = GPIO_PIN_7 | GPIO_PIN_11 | GPIO_PIN_12 | GPIO_PIN_13;
            ETH_PB_I = GPIO_PIN_10 | GPIO_PIN_0 | GPIO_PIN_1;
            ETH_PC_O = GPIO_PIN_1 | GPIO_PIN_2;
            ETH_PC_I = GPIO_PIN_3;
            ETH_PD_O = 0;
            ETH_PD_I = GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10;
            GPIO_ConfigPinRemap(GPIO_RMP3_ETH, ENABLE);
            break;
        default:
            while (1)
                ;
        }
    }
    else /* RMII */
    {
        switch (remap)
        {
        case 0:
        case 2:
            ETH_PA_O = GPIO_PIN_2;
            ETH_PA_I = GPIO_PIN_1 | GPIO_PIN_7;
            ETH_PB_O = GPIO_PIN_11 | GPIO_PIN_12 | GPIO_PIN_13;
            ETH_PB_I = 0;
            ETH_PC_O = GPIO_PIN_1;
            ETH_PC_I = GPIO_PIN_4 | GPIO_PIN_5;
            ETH_PD_O = 0;
            ETH_PD_I = 0;
            break;
        case 1:
        case 3:
            ETH_PA_O = GPIO_PIN_2;
            ETH_PA_I = GPIO_PIN_1;
            ETH_PB_O = GPIO_PIN_11 | GPIO_PIN_12 | GPIO_PIN_13;
            ETH_PB_I = 0;
            ETH_PC_O = GPIO_PIN_1;
            ETH_PC_I = 0;
            ETH_PD_O = 0;
            ETH_PD_I = GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10;
            GPIO_ConfigPinRemap(GPIO_RMP1_ETH, ENABLE);
            break;
        default:
            while (1)
                ;
        }
    }
    if (ETH_PA_O)
    {
        /* Configure Ethernet PA and PA8 (MCO) as alternate function push-pull */
        GPIO_InitStructure.Pin        = ETH_PA_O;
        GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
        GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;
        GPIO_InitPeripheral(GPIOA, &GPIO_InitStructure);
    }
    if (ETH_PB_O)
    {
        /* Configure Ethernet PB and PB5 (PPS) as alternate function push-pull */
        GPIO_InitStructure.Pin        = ETH_PB_O;
        GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
        GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;
        GPIO_InitPeripheral(GPIOB, &GPIO_InitStructure);
    }
    if (ETH_PC_O)
    {
        /* Configure Ethernet PC as alternate function push-pull */
        GPIO_InitStructure.Pin        = ETH_PC_O;
        GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
        GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;
        GPIO_InitPeripheral(GPIOC, &GPIO_InitStructure);
    }
    if (ETH_PD_O)
    {
        /* Configure Ethernet PD as alternate function push-pull */
        GPIO_InitStructure.Pin        = ETH_PD_O;
        GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
        GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_AF_PP;
        GPIO_InitPeripheral(GPIOD, &GPIO_InitStructure);
    }

    if (ETH_PA_I)
    {
        /* Configure Ethernet PA as input */
        GPIO_InitStructure.Pin        = ETH_PA_I;
        GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
        GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
        GPIO_InitPeripheral(GPIOA, &GPIO_InitStructure);
    }
    if (ETH_PB_I)
    {
        /* Configure Ethernet PB as input */
        GPIO_InitStructure.Pin        = ETH_PB_I;
        GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
        GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
        GPIO_InitPeripheral(GPIOB, &GPIO_InitStructure);
    }
    if (ETH_PC_I)
    {
        /* Configure Ethernet PC as input */
        GPIO_InitStructure.Pin        = ETH_PC_I;
        GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
        GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
        GPIO_InitPeripheral(GPIOC, &GPIO_InitStructure);
    }
    if (ETH_PD_I)
    {
        /* Configure Ethernet PD as input */
        GPIO_InitStructure.Pin        = ETH_PD_I;
        GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
        GPIO_InitStructure.GPIO_Mode  = GPIO_Mode_IN_FLOATING;
        GPIO_InitPeripheral(GPIOD, &GPIO_InitStructure);
    }
}

/** @addtogroup ETH_Private_TypesDefinitions
 * @{
 */
/**
 * @}
 */

