RT-Thread/rt-thread/bsp/n32g45x/Libraries/n32g45x_std_periph_driver/n32g45x_std_driver/src/n32g45x_eth.c
/*---------------------------------  PHY  ------------------------------------*/
/**
 * @brief  Read a PHY register
 * @param PHYAddress PHY device address, is the index of one of supported 32 PHY devices.
 *   This parameter can be one of the following values: 0,..,31
 * @param PHYReg PHY register address, is the index of one of the 32 PHY register.
 *   This parameter can be one of the following values:
 *     @arg PHY_BCR Tranceiver Basic Control Register
 *     @arg PHY_BSR Tranceiver Basic Status Register
 *     @arg PHY_SR Tranceiver Status Register
 *     @arg More PHY register could be read depending on the used PHY
 * @return ETH_ERROR: in case of timeout
 *         MAC MIIDR register value: Data read from the selected PHY register (correct read )
 */
uint16_t ETH_ReadPhyRegister(uint16_t PHYAddress, uint16_t PHYReg)
{
    uint32_t tmpregister  = 0;
    __IO uint32_t timeout = 0;
    /* Check the parameters */
    assert_param(IS_ETH_PHY_ADDRESS(PHYAddress));
    assert_param(IS_ETH_PHY_REG(PHYReg));

    /* Get the ETHERNET MACMIIADDR value */
    tmpregister = ETH->MACMIIADDR;
    /* Keep only the CTRLSTS Clock Range CTRL[2:0] bits value */
    tmpregister &= ~MACMIIAR_CR_MASK;
    /* Prepare the MII address register value */
    tmpregister |= (((uint32_t)PHYAddress << 11) & ETH_MACMIIADDR_PA); /* Set the PHY device address */
    tmpregister |= (((uint32_t)PHYReg << 6) & ETH_MACMIIADDR_MR);      /* Set the PHY register address */
    tmpregister &= ~ETH_MACMIIADDR_MW;                                 /* Set the read mode */
    tmpregister |= ETH_MACMIIADDR_MB;                                  /* Set the MII Busy bit */
    /* Write the result value into the MII Address register */
    ETH->MACMIIADDR = tmpregister;
    /* Check for the Busy flag */
    do
    {
        timeout++;
        tmpregister = ETH->MACMIIADDR;
    } while ((tmpregister & ETH_MACMIIADDR_MB) && (timeout < (uint32_t)PHY_READ_TO));
    /* Return ERROR in case of timeout */
    if (timeout == PHY_READ_TO)
    {
        return (uint16_t)ETH_ERROR;
    }

    /* Return data register value */
    uint16_t ret = (uint16_t)(ETH->MACMIIDAT);
    return ret;
}

/**
 * @brief  Write to a PHY register
 * @param PHYAddress PHY device address, is the index of one of supported 32 PHY devices.
 *   This parameter can be one of the following values: 0,..,31
 * @param PHYReg PHY register address, is the index of one of the 32 PHY register.
 *   This parameter can be one of the following values:
 *     @arg PHY_BCR Tranceiver Control Register
 *     @arg More PHY register could be written depending on the used PHY
 * @param PHYValue the value to write
 * @return ETH_ERROR: in case of timeout
 *         ETH_SUCCESS: for correct write
 */
uint32_t ETH_WritePhyRegister(uint16_t PHYAddress, uint16_t PHYReg, uint16_t PHYValue)
{
    uint32_t tmpregister  = 0;
    __IO uint32_t timeout = 0;
    /* Check the parameters */
    assert_param(IS_ETH_PHY_ADDRESS(PHYAddress));
    assert_param(IS_ETH_PHY_REG(PHYReg));

    /* Get the ETHERNET MACMIIADDR value */
    tmpregister = ETH->MACMIIADDR;
    /* Keep only the CTRLSTS Clock Range CTRL[2:0] bits value */
    tmpregister &= ~MACMIIAR_CR_MASK;
    /* Prepare the MII register address value */
    tmpregister |= (((uint32_t)PHYAddress << 11) & ETH_MACMIIADDR_PA); /* Set the PHY device address */
    tmpregister |= (((uint32_t)PHYReg << 6) & ETH_MACMIIADDR_MR);      /* Set the PHY register address */
    tmpregister |= ETH_MACMIIADDR_MW;                                  /* Set the write mode */
    tmpregister |= ETH_MACMIIADDR_MB;                                  /* Set the MII Busy bit */
    /* Give the value to the MII data register */
    ETH->MACMIIDAT = PHYValue;
    /* Write the result value into the MII Address register */
    ETH->MACMIIADDR = tmpregister;
    /* Check for the Busy flag */
    do
    {
        timeout++;
        tmpregister = ETH->MACMIIADDR;
    } while ((tmpregister & ETH_MACMIIADDR_MB) && (timeout < (uint32_t)PHY_WRITE_TO));
    /* Return ERROR in case of timeout */
    if (timeout == PHY_WRITE_TO)
    {
        return ETH_ERROR;
    }

    /* Return SUCCESS */
    return ETH_SUCCESS;
}

/**
 * @brief  Enables or disables the PHY loopBack mode.
 * @note: Don't be confused with ETH_MACLoopBackCmd function which enables internal
 *  loopback at MII level
 * @param PHYAddress PHY device address, is the index of one of supported 32 PHY devices.
 *   This parameter can be one of the following values:
 * @param Cmd new state of the PHY loopBack mode.
 *   This parameter can be: ENABLE or DISABLE.
 * @return ETH_ERROR: in case of bad PHY configuration
 *         ETH_SUCCESS: for correct PHY configuration
 */
uint32_t ETH_EnablePhyLoopBack(uint16_t PHYAddress, FunctionalState Cmd)
{
    uint16_t tmpregister = 0;
    /* Check the parameters */
    assert_param(IS_ETH_PHY_ADDRESS(PHYAddress));
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    /* Get the PHY configuration to update it */
    tmpregister = ETH_ReadPhyRegister(PHYAddress, PHY_BCR);

    if (Cmd != DISABLE)
    {
        /* Enable the PHY loopback mode */
        tmpregister |= PHY_LOOPBACK;
    }
    else
    {
        /* Disable the PHY loopback mode: normal mode */
        tmpregister &= (uint16_t)(~(uint16_t)PHY_LOOPBACK);
    }
    /* Update the PHY control register with the new configuration */
    if (ETH_WritePhyRegister(PHYAddress, PHY_BCR, tmpregister) != (uint32_t)RESET)
    {
        return ETH_SUCCESS;
    }
    else
    {
        /* Return SUCCESS */
        return ETH_ERROR;
    }
}

/*---------------------------------  MAC  ------------------------------------*/
/**
 * @brief  Enables or disables the MAC transmission.
 * @param Cmd new state of the MAC transmission.
 *   This parameter can be: ENABLE or DISABLE.
 */
void ETH_EnableMacTx(FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    if (Cmd != DISABLE)
    {
        /* Enable the MAC transmission */
        ETH->MACCFG |= ETH_MACCFG_TE;
    }
    else
    {
        /* Disable the MAC transmission */
        ETH->MACCFG &= ~ETH_MACCFG_TE;
    }
}

/**
 * @brief  Enables or disables the MAC reception.
 * @param Cmd new state of the MAC reception.
 *   This parameter can be: ENABLE or DISABLE.
 */
void ETH_EnableMacRx(FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    if (Cmd != DISABLE)
    {
        /* Enable the MAC reception */
        ETH->MACCFG |= ETH_MACCFG_RE;
    }
    else
    {
        /* Disable the MAC reception */
        ETH->MACCFG &= ~ETH_MACCFG_RE;
    }
}

/**
 * @brief  Checks whether the ETHERNET flow control busy bit is set or not.
 * @return The new state of flow control busy status bit (SET or RESET).
 */
FlagStatus ETH_GetFlowCtrlBusyStatus(void)
{
    FlagStatus bitstatus = RESET;
    /* The Flow Control register should not be written to until this bit is cleared */
    if ((ETH->MACFLWCTRL & ETH_MACFLWCTRL_FCB_BPA) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
 * @brief  Initiate a Pause Control Frame (Full-duplex only).
 */
void ETH_GeneratePauseCtrlFrame(void)
{
    /* When Set In full duplex MAC initiates pause control frame */
    ETH->MACFLWCTRL |= ETH_MACFLWCTRL_FCB_BPA;
}

/**
 * @brief  Enables or disables the MAC BackPressure operation activation (Half-duplex only).
 * @param Cmd new state of the MAC BackPressure operation activation.
 *   This parameter can be: ENABLE or DISABLE.
 */
void ETH_EnableBackPressureActivation(FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    if (Cmd != DISABLE)
    {
        /* Activate the MAC BackPressure operation */
        /* In Half duplex: during backpressure, when the MAC receives a new frame,
        the transmitter starts sending a JAM pattern resulting in a collision */
        ETH->MACFLWCTRL |= ETH_MACFLWCTRL_FCB_BPA;
    }
    else
    {
        /* Desactivate the MAC BackPressure operation */
        ETH->MACFLWCTRL &= ~ETH_MACFLWCTRL_FCB_BPA;
    }
}

/**
 * @brief  Checks whether the specified ETHERNET MAC flag is set or not.
 * @param ETH_MAC_FLAG specifies the flag to check.
 *   This parameter can be one of the following values:
 *     @arg ETH_MAC_FLAG_TST Time stamp trigger flag
 *     @arg ETH_MAC_FLAG_MMCTX MMC transmit flag
 *     @arg ETH_MAC_FLAG_MMCRX MMC receive flag
 *     @arg ETH_MAC_FLAG_MMC MMC flag
 *     @arg ETH_MAC_FLAG_PMT PMT flag
 * @return The new state of ETHERNET MAC flag (SET or RESET).
 */
FlagStatus ETH_GetMacFlagStatus(uint32_t ETH_MAC_FLAG)
{
    FlagStatus bitstatus = RESET;
    /* Check the parameters */
    assert_param(IS_ETH_MAC_GET_FLAG(ETH_MAC_FLAG));
    if ((ETH->MACINTSTS & ETH_MAC_FLAG) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
 * @brief  Checks whether the specified ETHERNET MAC interrupt has occurred or not.
 * @param ETH_MAC_IT specifies the interrupt source to check.
 *   This parameter can be one of the following values:
 *     @arg ETH_MAC_INT_TST Time stamp trigger interrupt
 *     @arg ETH_MAC_INT_MMCTX MMC transmit interrupt
 *     @arg ETH_MAC_INT_MMCRX MMC receive interrupt
 *     @arg ETH_MAC_INT_MMC MMC interrupt
 *     @arg ETH_MAC_INT_PMT PMT interrupt
 * @return The new state of ETHERNET MAC interrupt (SET or RESET).
 */
INTStatus ETH_GetMacIntStatus(uint32_t ETH_MAC_IT)
{
    INTStatus bitstatus = RESET;
    /* Check the parameters */
    assert_param(IS_ETH_MAC_GET_INT(ETH_MAC_IT));
    if ((ETH->MACINTSTS & ETH_MAC_IT) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
 * @brief  Enables or disables the specified ETHERNET MAC interrupts.
 * @param ETH_MAC_IT specifies the ETHERNET MAC interrupt sources to be
 *   enabled or disabled.
 *   This parameter can be any combination of the following values:
 *     @arg ETH_MAC_INT_TST Time stamp trigger interrupt
 *     @arg ETH_MAC_INT_PMT PMT interrupt
 * @param Cmd new state of the specified ETHERNET MAC interrupts.
 *   This parameter can be: ENABLE or DISABLE.
 */
void ETH_EnableMacInt(uint32_t ETH_MAC_IT, FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_ETH_MAC_INT(ETH_MAC_IT));
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    if (Cmd != DISABLE)
    {
        /* Enable the selected ETHERNET MAC interrupts */
        ETH->MACINTMSK &= (~(uint32_t)ETH_MAC_IT);
    }
    else
    {
        /* Disable the selected ETHERNET MAC interrupts */
        ETH->MACINTMSK |= ETH_MAC_IT;
    }
}

/**
 * @brief  Configures the selected MAC address.
 * @param MacAddr The MAC addres to configure.
 *   This parameter can be one of the following values:
 *     @arg ETH_MAC_ADDR0 MAC Address0
 *     @arg ETH_MAC_ADDR1 MAC Address1
 *     @arg ETH_MAC_ADDR2 MAC Address2
 *     @arg ETH_MAC_ADDR3 MAC Address3
 * @param Addr Pointer on MAC address buffer data (6 bytes).
 */
void ETH_SetMacAddr(uint32_t MacAddr, uint8_t* Addr)
{
    uint32_t tmpregister;
    /* Check the parameters */
    assert_param(IS_ETH_MAC_ADDR0123(MacAddr));

    /* Calculate the selectecd MAC address high register */
    tmpregister = ((uint32_t)Addr[5] << 8) | (uint32_t)Addr[4];
    /* Load the selectecd MAC address high register */
    (*(__IO uint32_t*)(ETH_MAC_ADDR_HBASE + MacAddr)) = tmpregister;
    /* Calculate the selectecd MAC address low register */
    tmpregister = ((uint32_t)Addr[3] << 24) | ((uint32_t)Addr[2] << 16) | ((uint32_t)Addr[1] << 8) | Addr[0];

    /* Load the selectecd MAC address low register */
    (*(__IO uint32_t*)(ETH_MAC_ADDR_LBASE + MacAddr)) = tmpregister;
}

/**
 * @brief  Get the selected MAC address.
 * @param MacAddr The MAC addres to return.
 *   This parameter can be one of the following values:
 *     @arg ETH_MAC_ADDR0 MAC Address0
 *     @arg ETH_MAC_ADDR1 MAC Address1
 *     @arg ETH_MAC_ADDR2 MAC Address2
 *     @arg ETH_MAC_ADDR3 MAC Address3
 * @param Addr Pointer on MAC address buffer data (6 bytes).
 */
void ETH_GetMacAddr(uint32_t MacAddr, uint8_t* Addr)
{
    uint32_t tmpregister;
    /* Check the parameters */
    assert_param(IS_ETH_MAC_ADDR0123(MacAddr));

