RT-Thread/rt-thread/bsp/n32g45x/Libraries/n32g45x_std_periph_driver/n32g45x_std_driver/src/n32g45x_eth.c
    /* Get the selectecd MAC address high register */
    tmpregister = (*(__IO uint32_t*)(ETH_MAC_ADDR_HBASE + MacAddr));

    /* Calculate the selectecd MAC address buffer */
    Addr[5] = ((tmpregister >> 8) & (uint8_t)0xFF);
    Addr[4] = (tmpregister & (uint8_t)0xFF);
    /* Load the selectecd MAC address low register */
    tmpregister = (*(__IO uint32_t*)(ETH_MAC_ADDR_LBASE + MacAddr));
    /* Calculate the selectecd MAC address buffer */
    Addr[3] = ((tmpregister >> 24) & (uint8_t)0xFF);
    Addr[2] = ((tmpregister >> 16) & (uint8_t)0xFF);
    Addr[1] = ((tmpregister >> 8) & (uint8_t)0xFF);
    Addr[0] = (tmpregister & (uint8_t)0xFF);
}

/**
 * @brief  Enables or disables the Address filter module uses the specified
 *   ETHERNET MAC address for perfect filtering
 * @param MacAddr specifies the ETHERNET MAC address to be used for prfect filtering.
 *   This parameter can be one of the following values:
 *     @arg ETH_MAC_ADDR1 MAC Address1
 *     @arg ETH_MAC_ADDR2 MAC Address2
 *     @arg ETH_MAC_ADDR3 MAC Address3
 * @param Cmd new state of the specified ETHERNET MAC address use.
 *   This parameter can be: ENABLE or DISABLE.
 */
void ETH_EnableMacAddrPerfectFilter(uint32_t MacAddr, FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_ETH_MAC_ADDR123(MacAddr));
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    if (Cmd != DISABLE)
    {
        /* Enable the selected ETHERNET MAC address for perfect filtering */
        (*(__IO uint32_t*)(ETH_MAC_ADDR_HBASE + MacAddr)) |= ETH_MACADDR1HI_AE;
    }
    else
    {
        /* Disable the selected ETHERNET MAC address for perfect filtering */
        (*(__IO uint32_t*)(ETH_MAC_ADDR_HBASE + MacAddr)) &= (~(uint32_t)ETH_MACADDR1HI_AE);
    }
}

/**
 * @brief  Set the filter type for the specified ETHERNET MAC address
 * @param MacAddr specifies the ETHERNET MAC address
 *   This parameter can be one of the following values:
 *     @arg ETH_MAC_ADDR1 MAC Address1
 *     @arg ETH_MAC_ADDR2 MAC Address2
 *     @arg ETH_MAC_ADDR3 MAC Address3
 * @param Filter specifies the used frame received field for comparaison
 *   This parameter can be one of the following values:
 *     @arg ETH_MAC_ADDR_FILTER_SA MAC Address is used to compare with the
 *                                     SA fields of the received frame.
 *     @arg ETH_MAC_ADDR_FILTER_DA MAC Address is used to compare with the
 *                                     DA fields of the received frame.
 */
void ETH_ConfigMacAddrFilter(uint32_t MacAddr, uint32_t Filter)
{
    /* Check the parameters */
    assert_param(IS_ETH_MAC_ADDR123(MacAddr));
    assert_param(IS_ETH_MAC_ADDR_FILTER(Filter));

    if (Filter != ETH_MAC_ADDR_FILTER_DA)
    {
        /* The selected ETHERNET MAC address is used to compare with the SA fields of the
        received frame. */
        (*(__IO uint32_t*)(ETH_MAC_ADDR_HBASE + MacAddr)) |= ETH_MACADDR1HI_SA;
    }
    else
    {
        /* The selected ETHERNET MAC address is used to compare with the DA fields of the
        received frame. */
        (*(__IO uint32_t*)(ETH_MAC_ADDR_HBASE + MacAddr)) &= (~(uint32_t)ETH_MACADDR1HI_SA);
    }
}

/**
 * @brief  Set the filter type for the specified ETHERNET MAC address
 * @param MacAddr specifies the ETHERNET MAC address
 *   This parameter can be one of the following values:
 *     @arg ETH_MAC_ADDR1 MAC Address1
 *     @arg ETH_MAC_ADDR2 MAC Address2
 *     @arg ETH_MAC_ADDR3 MAC Address3
 * @param MaskByte specifies the used address bytes for comparaison
 *   This parameter can be any combination of the following values:
 *     @arg ETH_MAC_ADDR_MASK_BYTE6 Mask MAC Address high reg bits [15:8].
 *     @arg ETH_MAC_ADDR_MASK_BYTE5 Mask MAC Address high reg bits [7:0].
 *     @arg ETH_MAC_ADDR_MASK_BYTE4 Mask MAC Address low reg bits [31:24].
 *     @arg ETH_MAC_ADDR_MASK_BYTE3 Mask MAC Address low reg bits [23:16].
 *     @arg ETH_MAC_ADDR_MASK_BYTE2 Mask MAC Address low reg bits [15:8].
 *     @arg ETH_MAC_ADDR_MASK_BYTE1 Mask MAC Address low reg bits [7:0].
 */
void ETH_ConfigMacAddrMaskBytesFilter(uint32_t MacAddr, uint32_t MaskByte)
{
    /* Check the parameters */
    assert_param(IS_ETH_MAC_ADDR123(MacAddr));
    assert_param(IS_ETH_MAC_ADDR_MASK(MaskByte));

    /* Clear MBC bits in the selected MAC address  high register */
    (*(__IO uint32_t*)(ETH_MAC_ADDR_HBASE + MacAddr)) &= (~(uint32_t)ETH_MACADDR1HI_MBC);
    /* Set the selected Filetr mask bytes */
    (*(__IO uint32_t*)(ETH_MAC_ADDR_HBASE + MacAddr)) |= MaskByte;
}
/*------------------------  DMA Tx/Rx Desciptors -----------------------------*/

/**
 * @brief  Initializes the DMA Tx descriptors in chain mode.
 * @param DMATxDescTab Pointer on the first Tx desc list
 * @param TxBuff Pointer on the first TxBuffer list
 * @param BuffSize Buffer size of each descriptor
 * @param TxBuffCount Number of the used Tx desc in the list
 */
void ETH_ConfigDmaTxDescInChainMode(ETH_DMADescType* DMATxDescTab,
                                    uint8_t* TxBuff,
                                    uint32_t BuffSize,
                                    uint32_t TxBuffCount)
{
    uint32_t i = 0;
    ETH_DMADescType* DMATxDesc;

    /* Set the DMATxDescToSet pointer with the first one of the DMATxDescTab list */
    DMATxDescToSet = DMATxDescTab;
    /* Fill each DMATxDesc descriptor with the right values */
    for (i = 0; i < TxBuffCount; i++)
    {
        /* Get the pointer on the ith member of the Tx Desc list */
        DMATxDesc = DMATxDescTab + i;
        /* Set Second Address Chained bit */
        DMATxDesc->Status        = 0;
        DMATxDesc->CtrlOrBufSize = ETH_DMA_TX_DESC_TCH;

        /* Set Buffer1 address pointer */
        DMATxDesc->Buf1Addr = (uint32_t)(&TxBuff[i * BuffSize]);

        /* Initialize the next descriptor with the Next Desciptor Polling Enable */
        if (i < (TxBuffCount - 1))
        {
            /* Set next descriptor address register with next descriptor base address */
            DMATxDesc->Buf2OrNextDescAddr = (uint32_t)(DMATxDescTab + i + 1);
        }
        else
        {
            /* For last descriptor, set next descriptor address register equal to the first descriptor base address */
            DMATxDesc->Buf2OrNextDescAddr = (uint32_t)DMATxDescTab;
        }
    }

    /* Set Transmit Desciptor List Address Register */
    ETH->DMATXDLADDR = (uint32_t)DMATxDescTab;
}

/**
 * @brief  Initializes the DMA Tx descriptors in ring mode.
 * @param DMATxDescTab Pointer on the first Tx desc list
 * @param TxBuff1 Pointer on the first TxBuffer1 list
 * @param TxBuff2 Pointer on the first TxBuffer2 list
 * @param BuffSize Buffer size of each descriptor
 * @param TxBuffCount Number of the used Tx desc in the list
 *   Note: see decriptor skip length defined in ETH_DMA_InitStruct
 *   for the number of Words to skip between two unchained descriptors.
 */
void ETH_ConfigDmaTxDescInRingMode(ETH_DMADescType* DMATxDescTab,
                                   uint8_t* TxBuff1,
                                   uint8_t* TxBuff2,
                                   uint32_t BuffSize,
                                   uint32_t TxBuffCount)
{
    uint32_t i = 0;
    ETH_DMADescType* DMATxDesc;
    uint32_t dsl = (ETH->DMABUSMOD & ETH_DMABUSMOD_DSL) >> 2;

    /* Set the DMATxDescToSet pointer with the first one of the DMATxDescTab list */
    DMATxDescToSet = DMATxDescTab;
    /* Fill each DMATxDesc descriptor with the right values */
    for (i = 0; i < TxBuffCount; i++)
    {
        /* Get the pointer on the ith member of the Tx Desc list */
        // DMATxDesc = DMATxDescTab + i;
        DMATxDesc = (ETH_DMADescType*)((uint32_t)DMATxDescTab + i * (16 + 4 * dsl));
        /* Set Buffer1 address pointer */
        DMATxDesc->Buf1Addr = (uint32_t)(&TxBuff1[i * BuffSize]);

        /* Set Buffer2 address pointer */
        DMATxDesc->Buf2OrNextDescAddr = (uint32_t)(&TxBuff2[i * BuffSize]);

        /* Set Transmit End of Ring bit for last descriptor: The DMA returns to the base
        address of the list, creating a Desciptor Ring */
        if (i == (TxBuffCount - 1))
        {
            /* Set Transmit End of Ring bit */
            DMATxDesc->CtrlOrBufSize = ETH_DMA_TX_DESC_TER;
        }
    }

    /* Set Transmit Desciptor List Address Register */
    ETH->DMATXDLADDR = (uint32_t)DMATxDescTab;
}

/**
 * @brief  Checks whether the specified ETHERNET DMA Tx Desc flag is set or not.
 * @param DMATxDesc pointer on a DMA Tx descriptor
 * @param ETH_DMATxDescFlag specifies the flag to check.
 *   This parameter can be one of the following values:
 *     @arg ETH_DMA_TX_DESC_OWN OWN bit: descriptor is owned by DMA engine
 *     @arg ETH_DMA_TX_DESC_IC Interrupt on completetion
 *     @arg ETH_DMA_TX_DESC_LS Last Segment
 *     @arg ETH_DMA_TX_DESC_FS First Segment
 *     @arg ETH_DMA_TX_DESC_DC Disable CRC
 *     @arg ETH_DMA_TX_DESC_DP Disable Pad
 *     @arg ETH_DMA_TX_DESC_TTSE Transmit Time Stamp Enable
 *     @arg ETH_DMA_TX_DESC_TER Transmit End of Ring
 *     @arg ETH_DMA_TX_DESC_TCH Second Address Chained
 *     @arg ETH_DMA_TX_DESC_TTSS Tx Time Stamp Status
 *     @arg ETH_DMA_TX_DESC_IHE IP Header Error
 *     @arg ETH_DMA_TX_DESC_ES Error summary
 *     @arg ETH_DMA_TX_DESC_JT Jabber Timeout
 *     @arg ETH_DMA_TX_DESC_FF Frame Flushed: DMA/MTL flushed the frame due to SW flush
 *     @arg ETH_DMA_TX_DESC_PCE Payload Checksum Error
 *     @arg ETH_DMA_TX_DESC_LOC Loss of Carrier: carrier lost during tramsmission
 *     @arg ETH_DMA_TX_DESC_NC No Carrier: no carrier signal from the tranceiver
 *     @arg ETH_DMA_TX_DESC_LC Late Collision: transmission aborted due to collision
 *     @arg ETH_DMA_TX_DESC_EC Excessive Collision: transmission aborted after 16 collisions
 *     @arg ETH_DMA_TX_DESC_VF VLAN Frame
 *     @arg ETH_DMA_TX_DESC_CC Collision Count
 *     @arg ETH_DMA_TX_DESC_ED Excessive Deferral
 *     @arg ETH_DMA_TX_DESC_UF Underflow Error: late data arrival from the memory
 *     @arg ETH_DMA_TX_DESC_DB Deferred Bit
 * @return The new state of ETH_DMATxDescFlag (SET or RESET).
 */
FlagStatus ETH_GetDmaTxDescFlagStatus(ETH_DMADescType* DMATxDesc, uint32_t ETH_DMATxDescFlag)
{
    FlagStatus bitstatus = RESET;
    /* Check the parameters */
    assert_param(IS_ETH_DMATXDESC_GET_FLAG(ETH_DMATxDescFlag));

    if ((DMATxDesc->Status & ETH_DMATxDescFlag) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
 * @brief  Returns the specified ETHERNET DMA Tx Desc collision count.
 * @param DMATxDesc pointer on a DMA Tx descriptor
 * @return The Transmit descriptor collision counter value.
 */
uint32_t ETH_GetDmaTxDescCollisionCount(ETH_DMADescType* DMATxDesc)
{
    /* Return the Receive descriptor frame length */
    return ((DMATxDesc->Status & ETH_DMA_TX_DESC_CC) >> ETH_DMA_TX_DESC_COLLISION_COUNTER_SHIFT);
}

/**
 * @brief  Set the specified DMA Tx Desc Own bit.
 * @param DMATxDesc Pointer on a Tx desc
 */
void ETH_SetDmaTxDescOwn(ETH_DMADescType* DMATxDesc)
{
    /* Set the DMA Tx Desc Own bit */
    DMATxDesc->Status |= ETH_DMA_TX_DESC_OWN;
}

/**
 * @brief  Enables or disables the specified DMA Tx Desc Transmit interrupt.
 * @param DMATxDesc Pointer on a Tx desc
 * @param Cmd new state of the DMA Tx Desc transmit interrupt.
 *   This parameter can be: ENABLE or DISABLE.
 */
void ETH_EnableDmaTxDescTransmitInt(ETH_DMADescType* DMATxDesc, FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    if (Cmd != DISABLE)
    {
        /* Enable the DMA Tx Desc Transmit interrupt */
        DMATxDesc->CtrlOrBufSize |= ETH_DMA_TX_DESC_IC;
    }
    else
    {
        /* Disable the DMA Tx Desc Transmit interrupt */
        DMATxDesc->CtrlOrBufSize &= (~(uint32_t)ETH_DMA_TX_DESC_IC);
    }
}

/**
 * @brief  Set the specified DMA Tx Desc frame segment.
 * @param DMATxDesc Pointer on a Tx desc
 * @param DMATxDesc_FrameSegment specifies is the actual Tx desc contain last or first segment.
 *   This parameter can be one of the following values:
 *     @arg ETH_DMA_TX_DESC_LAST_SEGMENT actual Tx desc contain last segment
 *     @arg ETH_DMA_TX_DESC_FIRST_SEGMENT actual Tx desc contain first segment
 */
void ETH_ConfigDmaTxDescFrameSegment(ETH_DMADescType* DMATxDesc, uint32_t DMATxDesc_FrameSegment)
{
    /* Check the parameters */
    assert_param(IS_ETH_DMA_TX_DESC_SEGMENT(DMATxDesc_FrameSegment));

    /* Selects the DMA Tx Desc Frame segment */
    DMATxDesc->CtrlOrBufSize |= DMATxDesc_FrameSegment;
}

/**
 * @brief  Selects the specified ETHERNET DMA Tx Desc Checksum Insertion.
 * @param DMATxDesc pointer on a DMA Tx descriptor
 * @param DMATxDesc_Checksum specifies is the DMA Tx desc checksum insertion.
 *   This parameter can be one of the following values:
 *     @arg ETH_DMA_TX_DESC_CHECKSUM_BYPASS Checksum bypass
 *     @arg ETH_DMA_TX_DESC_CHECKSUM_IPV4_HEADER IPv4 header checksum
 *     @arg ETH_DMA_TX_DESC_CHECKSUM_TCPUDPICMP_SEGMENT TCP/UDP/ICMP checksum. Pseudo header checksum is assumed to be
 * present
 *     @arg ETH_DMA_TX_DESC_CHECKSUM_TCPUDPICMP_FULL TCP/UDP/ICMP checksum fully in hardware including pseudo header
 */
void ETH_ConfigDmaTxDescChecksumInsertion(ETH_DMADescType* DMATxDesc, uint32_t DMATxDesc_Checksum)
{
    /* Check the parameters */
    assert_param(IS_ETH_DMA_TX_DESC_CHECKSUM(DMATxDesc_Checksum));

    /* Set the selected DMA Tx desc checksum insertion control */
    DMATxDesc->CtrlOrBufSize |= DMATxDesc_Checksum;
}

/**
 * @brief  Enables or disables the DMA Tx Desc CRC.
 * @param DMATxDesc pointer on a DMA Tx descriptor
 * @param Cmd new state of the specified DMA Tx Desc CRC.
 *   This parameter can be: ENABLE or DISABLE.
 */
void ETH_EnableDmaTxDescCrc(ETH_DMADescType* DMATxDesc, FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    if (Cmd != DISABLE)
    {
        /* Enable the selected DMA Tx Desc CRC */
        DMATxDesc->CtrlOrBufSize &= (~(uint32_t)ETH_DMA_TX_DESC_DC);
    }
    else
    {
        /* Disable the selected DMA Tx Desc CRC */
        DMATxDesc->CtrlOrBufSize |= ETH_DMA_TX_DESC_DC;
    }
}

/**
 * @brief  Enables or disables the DMA Tx Desc end of ring.
 * @param DMATxDesc pointer on a DMA Tx descriptor
 * @param Cmd new state of the specified DMA Tx Desc end of ring.
 *   This parameter can be: ENABLE or DISABLE.
 */
void ETH_EnableDmaTxDescEndOfRing(ETH_DMADescType* DMATxDesc, FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    if (Cmd != DISABLE)
    {
        /* Enable the selected DMA Tx Desc end of ring */
        DMATxDesc->CtrlOrBufSize |= ETH_DMA_TX_DESC_TER;
    }
    else
    {
        /* Disable the selected DMA Tx Desc end of ring */
        DMATxDesc->CtrlOrBufSize &= (~(uint32_t)ETH_DMA_TX_DESC_TER);
    }
}

/**
 * @brief  Enables or disables the DMA Tx Desc second address chained.
 * @param DMATxDesc pointer on a DMA Tx descriptor
 * @param Cmd new state of the specified DMA Tx Desc second address chained.
 *   This parameter can be: ENABLE or DISABLE.
 */
void ETH_EnableDmaTxDescSecondAddrChained(ETH_DMADescType* DMATxDesc, FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    if (Cmd != DISABLE)
    {
        /* Enable the selected DMA Tx Desc second address chained */
        DMATxDesc->CtrlOrBufSize |= ETH_DMA_TX_DESC_TCH;
    }
    else
    {
        /* Disable the selected DMA Tx Desc second address chained */
        DMATxDesc->CtrlOrBufSize &= (~(uint32_t)ETH_DMA_TX_DESC_TCH);
    }
}

/**
 * @brief  Enables or disables the DMA Tx Desc padding for frame shorter than 64 bytes.
 * @param DMATxDesc pointer on a DMA Tx descriptor
 * @param Cmd new state of the specified DMA Tx Desc padding for frame shorter than 64 bytes.
 *   This parameter can be: ENABLE or DISABLE.
 */
void ETH_EnableDmaTxDescShortFramePadding(ETH_DMADescType* DMATxDesc, FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    if (Cmd != DISABLE)
    {
        /* Enable the selected DMA Tx Desc padding for frame shorter than 64 bytes */
        DMATxDesc->CtrlOrBufSize &= (~(uint32_t)ETH_DMA_TX_DESC_DP);
    }
    else
    {
        /* Disable the selected DMA Tx Desc padding for frame shorter than 64 bytes*/
        DMATxDesc->CtrlOrBufSize |= ETH_DMA_TX_DESC_DP;
    }
}

/**
 * @brief  Enables or disables the DMA Tx Desc time stamp.
 * @param DMATxDesc pointer on a DMA Tx descriptor
 * @param Cmd new state of the specified DMA Tx Desc time stamp.
 *   This parameter can be: ENABLE or DISABLE.
 */
void ETH_EnableDmaTxDescTimeStamp(ETH_DMADescType* DMATxDesc, FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    if (Cmd != DISABLE)
    {
        /* Enable the selected DMA Tx Desc time stamp */
        DMATxDesc->CtrlOrBufSize |= ETH_DMA_TX_DESC_TTSE;
    }
    else
    {
        /* Disable the selected DMA Tx Desc time stamp */
        DMATxDesc->CtrlOrBufSize &= (~(uint32_t)ETH_DMA_TX_DESC_TTSE);
    }
}

/**
 * @brief  Configures the specified DMA Tx Desc buffer1 and buffer2 sizes.
 * @param DMATxDesc Pointer on a Tx desc
 * @param BufferSize1 specifies the Tx desc buffer1 size.
 * @param BufferSize2 specifies the Tx desc buffer2 size (put "0" if not used).
 */
void ETH_ConfigDmaTxDescBufSize(ETH_DMADescType* DMATxDesc, uint32_t BufferSize1, uint32_t BufferSize2)
{
    /* Check the parameters */
    assert_param(IS_ETH_DMA_TX_DESC_BUFFER_SIZE(BufferSize1));
    assert_param(IS_ETH_DMA_TX_DESC_BUFFER_SIZE(BufferSize2));

    /* Set the DMA Tx Desc buffer1 and buffer2 sizes values */
    DMATxDesc->CtrlOrBufSize |= (BufferSize1 | (BufferSize2 << ETH_DMA_TX_DESC_BUF2_SIZE_SHIFT));
}

/**
 * @brief  Initializes the DMA Rx descriptors in chain mode.
 * @param DMARxDescTab Pointer on the first Rx desc list
 * @param RxBuff Pointer on the first RxBuffer list
 * @param BuffSize the buffer size of each RxBuffer
 * @param RxBuffCount Number of the used Rx desc in the list
 */
void ETH_ConfigDmaRxDescInChainMode(ETH_DMADescType* DMARxDescTab,
                                    uint8_t* RxBuff,
                                    uint32_t BuffSize,
                                    uint32_t RxBuffCount)
{
    uint32_t i = 0;
    ETH_DMADescType* DMARxDesc;

    /* Set the DMARxDescToGet pointer with the first one of the DMARxDescTab list */
    DMARxDescToGet = DMARxDescTab;
    /* Fill each DMARxDesc descriptor with the right values */
    for (i = 0; i < RxBuffCount; i++)
    {
        /* Get the pointer on the ith member of the Rx Desc list */
        DMARxDesc = DMARxDescTab + i;
        /* Set Own bit of the Rx descriptor Status */
        DMARxDesc->Status = ETH_DMA_RX_DESC_OWN;

