RT-Thread/rt-thread/bsp/n32g45x/Libraries/n32g45x_std_periph_driver/n32g45x_std_driver/src/n32g45x_eth.c
        /* Set Buffer1 size and Second Address Chained bit */
        DMARxDesc->CtrlOrBufSize = ETH_DMA_RX_DESC_RCH | (uint32_t)(BuffSize & 0x1FFFUL);
        /* Set Buffer1 address pointer */
        DMARxDesc->Buf1Addr = (uint32_t)(&RxBuff[i * BuffSize]);

        /* Initialize the next descriptor with the Next Desciptor Polling Enable */
        if (i < (RxBuffCount - 1))
        {
            /* Set next descriptor address register with next descriptor base address */
            DMARxDesc->Buf2OrNextDescAddr = (uint32_t)(DMARxDescTab + i + 1);
        }
        else
        {
            /* For last descriptor, set next descriptor address register equal to the first descriptor base address */
            DMARxDesc->Buf2OrNextDescAddr = (uint32_t)(DMARxDescTab);
        }
    }

    /* Set Receive Desciptor List Address Register */
    ETH->DMARXDLADDR = (uint32_t)DMARxDescTab;
}

/**
 * @brief  Initializes the DMA Rx descriptors in ring mode.
 * @param DMARxDescTab Pointer on the first Rx desc list
 * @param RxBuff1 Pointer on the first RxBuffer1 list
 * @param RxBuff2 Pointer on the first RxBuffer2 list
 * @param BuffSize the buffer size of each RxBuffer
 * @param RxBuffCount Number of the used Rx desc in the list
 *   Note: see decriptor skip length defined in ETH_DMA_InitStruct
 *   for the number of Words to skip between two unchained descriptors.
 */
void ETH_ConfigDmaRxDescInRingMode(ETH_DMADescType* DMARxDescTab,
                                   uint8_t* RxBuff1,
                                   uint8_t* RxBuff2,
                                   uint32_t BuffSize,
                                   uint32_t RxBuffCount)
{
    uint32_t i = 0;
    ETH_DMADescType* DMARxDesc;
    uint32_t dsl = (ETH->DMABUSMOD & ETH_DMABUSMOD_DSL) >> 2;
    /* Set the DMARxDescToGet pointer with the first one of the DMARxDescTab list */
    DMARxDescToGet = DMARxDescTab;
    /* Fill each DMARxDesc descriptor with the right values */
    for (i = 0; i < RxBuffCount; i++)
    {
        /* Get the pointer on the ith member of the Rx Desc list */
        // DMARxDesc = DMARxDescTab + i;
        DMARxDesc = (ETH_DMADescType*)((uint32_t)DMARxDescTab + i * (16 + 4 * dsl));
        /* Set Own bit of the Rx descriptor Status */
        DMARxDesc->Status = ETH_DMA_RX_DESC_OWN;
        /* Set Buffer1 size */
        DMARxDesc->CtrlOrBufSize = BuffSize;
        /* Set Buffer1 address pointer */
        DMARxDesc->Buf1Addr = (uint32_t)(&RxBuff1[i * BuffSize]);

        /* Set Buffer2 address pointer */
        DMARxDesc->Buf2OrNextDescAddr = (uint32_t)(&RxBuff2[i * BuffSize]);

        /* Set Receive End of Ring bit for last descriptor: The DMA returns to the base
        address of the list, creating a Desciptor Ring */
        if (i == (RxBuffCount - 1))
        {
            /* Set Receive End of Ring bit */
            DMARxDesc->CtrlOrBufSize |= ETH_DMA_RX_DESC_RER;
        }
    }

    /* Set Receive Desciptor List Address Register */
    ETH->DMARXDLADDR = (uint32_t)DMARxDescTab;
}

/**
 * @brief  Checks whether the specified ETHERNET Rx Desc flag is set or not.
 * @param DMARxDesc pointer on a DMA Rx descriptor
 * @param ETH_DMARxDescFlag specifies the flag to check.
 *   This parameter can be one of the following values:
 *     @arg ETH_DMA_RX_DESC_OWN OWN bit: descriptor is owned by DMA engine
 *     @arg ETH_DMA_RX_DESC_AFM DA Filter Fail for the rx frame
 *     @arg ETH_DMA_RX_DESC_ES Error summary
 *     @arg ETH_DMA_RX_DESC_DE Desciptor error: no more descriptors for receive frame
 *     @arg ETH_DMA_RX_DESC_SAF SA Filter Fail for the received frame
 *     @arg ETH_DMA_RX_DESC_LE Frame size not matching with length field
 *     @arg ETH_DMA_RX_DESC_OE Overflow Error: Frame was damaged due to buffer overflow
 *     @arg ETH_DMA_RX_DESC_VLAN VLAN Tag: received frame is a VLAN frame
 *     @arg ETH_DMA_RX_DESC_FS First descriptor of the frame
 *     @arg ETH_DMA_RX_DESC_LS Last descriptor of the frame
 *     @arg ETH_DMA_RX_DESC_IPV4HCE IPC Checksum Error/Giant Frame: Rx Ipv4 header checksum error
 *     @arg ETH_DMA_RX_DESC_LC Late collision occurred during reception
 *     @arg ETH_DMA_RX_DESC_FT Frame type - Ethernet, otherwise 802.3
 *     @arg ETH_DMA_RX_DESC_RWT Receive Watchdog Timeout: watchdog timer expired during reception
 *     @arg ETH_DMA_RX_DESC_RE Receive error: error reported by MII interface
 *     @arg ETH_DMA_RX_DESC_DE Dribble bit error: frame contains non int multiple of 8 bits
 *     @arg ETH_DMA_RX_DESC_CE CRC error
 *     @arg ETH_DMA_RX_DESC_RMAPCE Rx MAC Address/Payload Checksum Error: Rx MAC address matched/ Rx Payload Checksum
 * Error
 * @return The new state of ETH_DMARxDescFlag (SET or RESET).
 */
FlagStatus ETH_GetDmaRxDescFlagStatus(ETH_DMADescType* DMARxDesc, uint32_t ETH_DMARxDescFlag)
{
    FlagStatus bitstatus = RESET;
    /* Check the parameters */
    assert_param(IS_ETH_DMA_RX_DESC_GET_FLAG(ETH_DMARxDescFlag));
    if ((DMARxDesc->Status & ETH_DMARxDescFlag) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
 * @brief  Set the specified DMA Rx Desc Own bit.
 * @param DMARxDesc Pointer on a Rx desc
 */
void ETH_SetDmaRxDescOwn(ETH_DMADescType* DMARxDesc)
{
    /* Set the DMA Rx Desc Own bit */
    DMARxDesc->Status |= ETH_DMA_RX_DESC_OWN;
}

/**
 * @brief  Returns the specified DMA Rx Desc frame length.
 * @param DMARxDesc pointer on a DMA Rx descriptor
 * @return The Rx descriptor received frame length.
 */
uint32_t ETH_GetDmaRxDescFrameLen(__IO ETH_DMADescType* DMARxDesc)
{
    /* Return the Receive descriptor frame length */
    return ((DMARxDesc->Status & ETH_DMA_RX_DESC_FL) >> ETH_DMA_RX_DESC_FRAME_LEN_SHIFT);
}

/**
 * @brief  Enables or disables the specified DMA Rx Desc receive interrupt.
 * @param DMARxDesc Pointer on a Rx desc
 * @param Cmd new state of the specified DMA Rx Desc interrupt.
 *   This parameter can be: ENABLE or DISABLE.
 */
void ETH_EnableDmaRxDescReceiveInt(ETH_DMADescType* DMARxDesc, FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    if (Cmd != DISABLE)
    {
        /* Enable the DMA Rx Desc receive interrupt */
        DMARxDesc->CtrlOrBufSize &= (~(uint32_t)ETH_DMA_RX_DESC_DIC);
    }
    else
    {
        /* Disable the DMA Rx Desc receive interrupt */
        DMARxDesc->CtrlOrBufSize |= ETH_DMA_RX_DESC_DIC;
    }
}

/**
 * @brief  Enables or disables the DMA Rx Desc end of ring.
 * @param DMARxDesc pointer on a DMA Rx descriptor
 * @param Cmd new state of the specified DMA Rx Desc end of ring.
 *   This parameter can be: ENABLE or DISABLE.
 */
void ETH_EnableDmaRxDescEndOfRing(ETH_DMADescType* DMARxDesc, FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    if (Cmd != DISABLE)
    {
        /* Enable the selected DMA Rx Desc end of ring */
        DMARxDesc->CtrlOrBufSize |= ETH_DMA_RX_DESC_RER;
    }
    else
    {
        /* Disable the selected DMA Rx Desc end of ring */
        DMARxDesc->CtrlOrBufSize &= (~(uint32_t)ETH_DMA_RX_DESC_RER);
    }
}

/**
 * @brief  Enables or disables the DMA Rx Desc second address chained.
 * @param DMARxDesc pointer on a DMA Rx descriptor
 * @param Cmd new state of the specified DMA Rx Desc second address chained.
 *   This parameter can be: ENABLE or DISABLE.
 */
void ETH_EnableDmaRxDescSecondAddrChained(ETH_DMADescType* DMARxDesc, FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    if (Cmd != DISABLE)
    {
        /* Enable the selected DMA Rx Desc second address chained */
        DMARxDesc->CtrlOrBufSize |= ETH_DMA_RX_DESC_RCH;
    }
    else
    {
        /* Disable the selected DMA Rx Desc second address chained */
        DMARxDesc->CtrlOrBufSize &= (~(uint32_t)ETH_DMA_RX_DESC_RCH);
    }
}

/**
 * @brief  Returns the specified ETHERNET DMA Rx Desc buffer size.
 * @param DMARxDesc pointer on a DMA Rx descriptor
 * @param DMARxDesc_Buffer specifies the DMA Rx Desc buffer.
 *   This parameter can be any one of the following values:
 *     @arg ETH_DMA_RX_DESC_BUFFER1 DMA Rx Desc Buffer1
 *     @arg ETH_DMA_RX_DESC_BUFFER2 DMA Rx Desc Buffer2
 * @return The Receive descriptor frame length.
 */
uint32_t ETH_GetDmaRxDescBufSize(ETH_DMADescType* DMARxDesc, uint32_t DMARxDesc_Buffer)
{
    /* Check the parameters */
    assert_param(IS_ETH_DMA_RXDESC_BUFFER(DMARxDesc_Buffer));

    if (DMARxDesc_Buffer != ETH_DMA_RX_DESC_BUFFER1)
    {
        /* Return the DMA Rx Desc buffer2 size */
        return ((DMARxDesc->CtrlOrBufSize & ETH_DMA_RX_DESC_RBS2) >> ETH_DMA_RX_DESC_BUF2_SIZE_SHIFT);
    }
    else
    {
        /* Return the DMA Rx Desc buffer1 size */
        return (DMARxDesc->CtrlOrBufSize & ETH_DMA_RX_DESC_RBS1);
    }
}

/*---------------------------------  DMA  ------------------------------------*/
/**
 * @brief  Resets all MAC subsystem internal registers and logic.
 */
void ETH_SoftwareReset(void)
{
    /* Set the SWR bit: resets all MAC subsystem internal registers and logic */
    /* After reset all the registers holds their respective reset values */
    ETH->DMABUSMOD |= ETH_DMABUSMOD_SWR;
}

/**
 * @brief  Checks whether the ETHERNET software reset bit is set or not.
 * @return The new state of DMA Bus Mode register STS bit (SET or RESET).
 */
FlagStatus ETH_GetSoftwareResetStatus(void)
{
    FlagStatus bitstatus = RESET;
    if ((ETH->DMABUSMOD & ETH_DMABUSMOD_SWR) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
 * @brief  Checks whether the specified ETHERNET DMA flag is set or not.
 * @param ETH_DMA_FLAG specifies the flag to check.
 *   This parameter can be one of the following values:
 *     @arg ETH_DMA_FLAG_TST Time-stamp trigger flag
 *     @arg ETH_DMA_FLAG_PMT PMT flag
 *     @arg ETH_DMA_FLAG_MMC MMC flag
 *     @arg ETH_DMA_FLAG_DATA_TRANSFER_ERROR Error bits 0-data buffer, 1-desc. access
 *     @arg ETH_DMA_FLAG_READ_WRITE_ERROR Error bits 0-write trnsf, 1-read transfr
 *     @arg ETH_DMA_FLAG_ACCESS_ERROR Error bits 0-Rx DMA, 1-Tx DMA
 *     @arg ETH_DMA_FLAG_NIS Normal interrupt summary flag
 *     @arg ETH_DMA_FLAG_AIS Abnormal interrupt summary flag
 *     @arg ETH_DMA_FLAG_EARLY_RX Early receive flag
 *     @arg ETH_DMA_FLAG_FATAL_BUS_ERROR Fatal bus error flag
 *     @arg ETH_DMA_FLAG_EARLY_TX Early transmit flag
 *     @arg ETH_DMA_FLAG_RX_WDG_TIMEOUT Receive watchdog timeout flag
 *     @arg ETH_DMA_FLAG_RX_PROC_STOP Receive process stopped flag
 *     @arg ETH_DMA_FLAG_RX_BUF_UA Receive buffer unavailable flag
 *     @arg ETH_DMA_FLAG_RX Receive flag
 *     @arg ETH_DMA_FLAG_TX_UNDERFLOW Underflow flag
 *     @arg ETH_DMA_FLAG_RX_OVERFLOW Overflow flag
 *     @arg ETH_DMA_FLAG_TX_JABBER_TIMEOUT Transmit jabber timeout flag
 *     @arg ETH_DMA_FLAG_TX_BUF_UA Transmit buffer unavailable flag
 *     @arg ETH_DMA_FLAG_TX_PROC_STOP Transmit process stopped flag
 *     @arg ETH_DMA_FLAG_TX Transmit flag
 * @return The new state of ETH_DMA_FLAG (SET or RESET).
 */
FlagStatus ETH_GetDmaFlagStatus(uint32_t ETH_DMA_FLAG)
{
    FlagStatus bitstatus = RESET;
    /* Check the parameters */
    assert_param(IS_ETH_DMA_GET_INT(ETH_DMA_FLAG));
    if ((ETH->DMASTS & ETH_DMA_FLAG) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
 * @brief  Clears the ETHERNET's DMA pending flag.
 * @param ETH_DMA_FLAG specifies the flag to clear.
 *   This parameter can be any combination of the following values:
 *     @arg ETH_DMA_FLAG_NIS Normal interrupt summary flag
 *     @arg ETH_DMA_FLAG_AIS Abnormal interrupt summary flag
 *     @arg ETH_DMA_FLAG_EARLY_RX Early receive flag
 *     @arg ETH_DMA_FLAG_FATAL_BUS_ERROR Fatal bus error flag
 *     @arg ETH_DMA_FLAG_ETI Early transmit flag
 *     @arg ETH_DMA_FLAG_RX_WDG_TIMEOUT Receive watchdog timeout flag
 *     @arg ETH_DMA_FLAG_RX_PROC_STOP Receive process stopped flag
 *     @arg ETH_DMA_FLAG_RX_BUF_UA Receive buffer unavailable flag
 *     @arg ETH_DMA_FLAG_RX Receive flag
 *     @arg ETH_DMA_FLAG_TX_UNDERFLOW Transmit Underflow flag
 *     @arg ETH_DMA_FLAG_RX_OVERFLOW Receive Overflow flag
 *     @arg ETH_DMA_FLAG_TX_JABBER_TIMEOUT Transmit jabber timeout flag
 *     @arg ETH_DMA_FLAG_TX_BUF_UA Transmit buffer unavailable flag
 *     @arg ETH_DMA_FLAG_TX_PROC_STOP Transmit process stopped flag
 *     @arg ETH_DMA_FLAG_TX Transmit flag
 */
void ETH_ClrDmaFlag(uint32_t ETH_DMA_FLAG)
{
    /* Check the parameters */
    assert_param(IS_ETH_DMA_FLAG(ETH_DMA_FLAG));

    /* Clear the selected ETHERNET DMA FLAG */
    ETH->DMASTS = (uint32_t)ETH_DMA_FLAG;
}

/**
 * @brief  Checks whether the specified ETHERNET DMA interrupt has occured or not.
 * @param ETH_DMA_IT specifies the interrupt source to check.
 *   This parameter can be one of the following values:
 *     @arg ETH_DMA_INT_TST Time-stamp trigger interrupt
 *     @arg ETH_DMA_INT_PMT PMT interrupt
 *     @arg ETH_DMA_INT_MMC MMC interrupt
 *     @arg ETH_DMA_INT_NIS Normal interrupt summary
 *     @arg ETH_DMA_INT_AIS Abnormal interrupt summary
 *     @arg ETH_DMA_INT_EARLY_RX Early receive interrupt
 *     @arg ETH_DMA_INT_FATAL_BUS_ERROR Fatal bus error interrupt
 *     @arg ETH_DMA_INT_EARLY_TX Early transmit interrupt
 *     @arg ETH_DMA_INT_RX_WDG_TIMEOUT Receive watchdog timeout interrupt
 *     @arg ETH_DMA_INT_RX_PROC_STOP Receive process stopped interrupt
 *     @arg ETH_DMA_INT_RX_BUF_UA Receive buffer unavailable interrupt
 *     @arg ETH_DMA_INT_RX Receive interrupt
 *     @arg ETH_DMA_INT_TX_UNDERFLOW Underflow interrupt
 *     @arg ETH_DMA_INT_RX_OVERFLOW Overflow interrupt
 *     @arg ETH_DMA_INT_TX_JABBER_TIMEOUT Transmit jabber timeout interrupt
 *     @arg ETH_DMA_INT_TX_BUF_UA Transmit buffer unavailable interrupt
 *     @arg ETH_DMA_INT_TX_PROC_STOP Transmit process stopped interrupt
 *     @arg ETH_DMA_INT_TX Transmit interrupt
 * @return The new state of ETH_DMA_IT (SET or RESET).
 */
INTStatus ETH_GetDmaIntStatus(uint32_t ETH_DMA_IT)
{
    INTStatus bitstatus = RESET;
    /* Check the parameters */
    assert_param(IS_ETH_DMA_GET_INT(ETH_DMA_IT));
    if ((ETH->DMASTS & ETH_DMA_IT) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
 * @brief  Clears the ETHERNET's DMA IT pending bit.
 * @param ETH_DMA_IT specifies the interrupt pending bit to clear.
 *   This parameter can be any combination of the following values:
 *     @arg ETH_DMA_INT_NIS Normal interrupt summary
 *     @arg ETH_DMA_INT_AIS Abnormal interrupt summary
 *     @arg ETH_DMA_INT_EARLY_RX Early receive interrupt
 *     @arg ETH_DMA_INT_FATAL_BUS_ERROR Fatal bus error interrupt
 *     @arg ETH_DMA_IT_ETI Early transmit interrupt
 *     @arg ETH_DMA_INT_RX_WDG_TIMEOUT Receive watchdog timeout interrupt
 *     @arg ETH_DMA_INT_RX_PROC_STOP Receive process stopped interrupt
 *     @arg ETH_DMA_INT_RX_BUF_UA Receive buffer unavailable interrupt
 *     @arg ETH_DMA_INT_RX Receive interrupt
 *     @arg ETH_DMA_INT_TX_UNDERFLOW Transmit Underflow interrupt
 *     @arg ETH_DMA_INT_RX_OVERFLOW Receive Overflow interrupt
 *     @arg ETH_DMA_INT_TX_JABBER_TIMEOUT Transmit jabber timeout interrupt
 *     @arg ETH_DMA_INT_TX_BUF_UA Transmit buffer unavailable interrupt
 *     @arg ETH_DMA_INT_TX_PROC_STOP Transmit process stopped interrupt
 *     @arg ETH_DMA_INT_TX Transmit interrupt
 */
void ETH_ClrDmaIntPendingBit(uint32_t ETH_DMA_IT)
{
    /* Check the parameters */
    assert_param(IS_ETH_DMA_INT(ETH_DMA_IT));

