RT-Thread/rt-thread/bsp/n32g45x/Libraries/n32g45x_std_periph_driver/n32g45x_std_driver/src/n32g45x_eth.c
    /* Clear the selected ETHERNET DMA IT */
    ETH->DMASTS = (uint32_t)ETH_DMA_IT;
}

/**
 * @brief  Returns the ETHERNET DMA Transmit Process State.
 * @return The new ETHERNET DMA Transmit Process State:
 *   This can be one of the following values:
 *     - ETH_DMA_TX_PROC_STOPPED   : Stopped - Reset or Stop Tx Command issued
 *     - ETH_DMA_TX_PROC_FETCHING  : Running - fetching the Tx descriptor
 *     - ETH_DMA_TX_PROC_WAITING   : Running - waiting for status
 *     - ETH_DMA_TX_PROC_READING   : unning - reading the data from host memory
 *     - ETH_DMA_TX_PROC_SUSPENDED : Suspended - Tx Desciptor unavailabe
 *     - ETH_DMA_TX_PROC_CLOSING   : Running - closing Rx descriptor
 */
uint32_t ETH_GetTxProcState(void)
{
    return ((uint32_t)(ETH->DMASTS & ETH_DMASTS_TI));
}

/**
 * @brief  Returns the ETHERNET DMA Receive Process State.
 * @return The new ETHERNET DMA Receive Process State:
 *   This can be one of the following values:
 *     - ETH_DMA_RX_PROC_STOPPED   : Stopped - Reset or Stop Rx Command issued
 *     - ETH_DMA_RX_PROC_FETCHING  : Running - fetching the Rx descriptor
 *     - ETH_DMA_RX_PROC_WAITING   : Running - waiting for packet
 *     - ETH_DMA_RX_PROC_SUSPENDED : Suspended - Rx Desciptor unavailable
 *     - ETH_DMA_RX_PROC_CLOSING   : Running - closing descriptor
 *     - ETH_DMA_RX_PROC_QUEUING   : Running - queuing the recieve frame into host memory
 */
uint32_t ETH_GetRxProcState(void)
{
    return ((uint32_t)(ETH->DMASTS & ETH_DMASTS_RI));
}

/**
 * @brief  Clears the ETHERNET transmit DATFIFO.
 */
void ETH_FlushTxFifo(void)
{
    /* Set the Flush Transmit DATFIFO bit */
    ETH->DMAOPMOD |= ETH_DMAOPMOD_FTF;
}

/**
 * @brief  Checks whether the ETHERNET transmit DATFIFO bit is cleared or not.
 * @return The new state of ETHERNET flush transmit DATFIFO bit (SET or RESET).
 */
FlagStatus ETH_GetFlushTxFifoStatus(void)
{
    FlagStatus bitstatus = RESET;
    if ((ETH->DMAOPMOD & ETH_DMAOPMOD_FTF) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
 * @brief  Enables or disables the DMA transmission.
 * @param Cmd new state of the DMA transmission.
 *   This parameter can be: ENABLE or DISABLE.
 */
void ETH_EnableDmaTx(FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    if (Cmd != DISABLE)
    {
        /* Enable the DMA transmission */
        ETH->DMAOPMOD |= ETH_DMAOPMOD_ST;
    }
    else
    {
        /* Disable the DMA transmission */
        ETH->DMAOPMOD &= ~ETH_DMAOPMOD_ST;
    }
}

/**
 * @brief  Enables or disables the DMA reception.
 * @param Cmd new state of the DMA reception.
 *   This parameter can be: ENABLE or DISABLE.
 */
void ETH_EnableDmaRx(FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    if (Cmd != DISABLE)
    {
        /* Enable the DMA reception */
        ETH->DMAOPMOD |= ETH_DMAOPMOD_SR;
    }
    else
    {
        /* Disable the DMA reception */
        ETH->DMAOPMOD &= ~ETH_DMAOPMOD_SR;
    }
}

/**
 * @brief  Enables or disables the specified ETHERNET DMA interrupts.
 * @param ETH_DMA_IT specifies the ETHERNET DMA interrupt sources to be
 *   enabled or disabled.
 *   This parameter can be any combination of the following values:
 *     @arg ETH_DMA_INT_NIS Normal interrupt summary
 *     @arg ETH_DMA_INT_AIS Abnormal interrupt summary
 *     @arg ETH_DMA_INT_EARLY_RX Early receive interrupt
 *     @arg ETH_DMA_INT_FATAL_BUS_ERROR Fatal bus error interrupt
 *     @arg ETH_DMA_INT_EARLY_TX Early transmit interrupt
 *     @arg ETH_DMA_INT_RX_WDG_TIMEOUT Receive watchdog timeout interrupt
 *     @arg ETH_DMA_INT_RX_PROC_STOP Receive process stopped interrupt
 *     @arg ETH_DMA_INT_RX_BUF_UA Receive buffer unavailable interrupt
 *     @arg ETH_DMA_INT_RX Receive interrupt
 *     @arg ETH_DMA_INT_TX_UNDERFLOW Underflow interrupt
 *     @arg ETH_DMA_INT_RX_OVERFLOW Overflow interrupt
 *     @arg ETH_DMA_INT_TX_JABBER_TIMEOUT Transmit jabber timeout interrupt
 *     @arg ETH_DMA_INT_TX_BUF_UA Transmit buffer unavailable interrupt
 *     @arg ETH_DMA_INT_TX_PROC_STOP Transmit process stopped interrupt
 *     @arg ETH_DMA_INT_TX Transmit interrupt
 * @param Cmd new state of the specified ETHERNET DMA interrupts.
 *   This parameter can be: ENABLE or DISABLE.
 */
void ETH_EnableDmaInt(uint32_t ETH_DMA_IT, FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_ETH_DMA_INT(ETH_DMA_IT));
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    if (Cmd != DISABLE)
    {
        /* Enable the selected ETHERNET DMA interrupts */
        ETH->DMAINTEN |= ETH_DMA_IT;
    }
    else
    {
        /* Disable the selected ETHERNET DMA interrupts */
        ETH->DMAINTEN &= (~(uint32_t)ETH_DMA_IT);
    }
}

/**
 * @brief  Checks whether the specified ETHERNET DMA overflow flag is set or not.
 * @param ETH_DMA_Overflow specifies the DMA overflow flag to check.
 *   This parameter can be one of the following values:
 *     @arg ETH_DMA_OVERFLOW_RX_FIFO_COUNTER Overflow for DATFIFO Overflow Counter
 *     @arg ETH_DMA_OVERFLOW_MISSED_FRAME_COUNTER Overflow for Missed Frame Counter
 * @return The new state of ETHERNET DMA overflow Flag (SET or RESET).
 */
FlagStatus ETH_GetDmaOverflowStatus(uint32_t ETH_DMA_Overflow)
{
    FlagStatus bitstatus = RESET;
    /* Check the parameters */
    assert_param(IS_ETH_DMA_GET_OVERFLOW(ETH_DMA_Overflow));

    if ((ETH->DMAMFBOCNT & ETH_DMA_Overflow) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
 * @brief  Get the ETHERNET DMA Rx Overflow Missed Frame Counter value.
 * @return The value of Rx overflow Missed Frame Counter.
 */
uint32_t ETH_GetRxOverflowMissedFrameCounter(void)
{
    return ((uint32_t)((ETH->DMAMFBOCNT & ETH_DMAMFBOCNT_OVFFRMCNT) >> ETH_DMA_RX_OVERFLOW_MISSEDFRAMES_COUNTER_SHIFT));
}

/**
 * @brief  Get the ETHERNET DMA Buffer Unavailable Missed Frame Counter value.
 * @return The value of Buffer unavailable Missed Frame Counter.
 */
uint32_t ETH_GetBufUnavailableMissedFrameCounter(void)
{
    return ((uint32_t)(ETH->DMAMFBOCNT) & ETH_DMAMFBOCNT_MISFRMCNT);
}

/**
 * @brief  Get the ETHERNET DMA DMACHTXDESC register value.
 * @return The value of the current Tx desc start address.
 */
uint32_t ETH_GetCurrentTxDescAddr(void)
{
    return ((uint32_t)(ETH->DMACHTXDESC));
}

/**
 * @brief  Get the ETHERNET DMA DMACHRXDESC register value.
 * @return The value of the current Rx desc start address.
 */
uint32_t ETH_GetCurrentRxDescAddr(void)
{
    return ((uint32_t)(ETH->DMACHRXDESC));
}

/**
 * @brief  Get the ETHERNET DMA DMACHTXBADDR register value.
 * @return The value of the current Tx buffer address.
 */
uint32_t ETH_GetCurrentTxBufAddr(void)
{
    return ((uint32_t)(ETH->DMACHTXBADDR));
}

/**
 * @brief  Get the ETHERNET DMA DMACHRXBADDR register value.
 * @return The value of the current Rx buffer address.
 */
uint32_t ETH_GetCurrentRxBufAddr(void)
{
    return ((uint32_t)(ETH->DMACHRXBADDR));
}

/**
 * @brief  Resumes the DMA Transmission by writing to the DmaTxPollDemand register
 *   (the data written could be anything). This forces  the DMA to resume transmission.
 */
void ETH_ResumeDmaTx(void)
{
    ETH->DMATXPD = 0;
}

/**
 * @brief  Resumes the DMA Transmission by writing to the DmaRxPollDemand register
 *   (the data written could be anything). This forces the DMA to resume reception.
 */
void ETH_ResumeDmaRx(void)
{
    ETH->DMARXPD = 0;
}

/*---------------------------------  PMT  ------------------------------------*/
/**
 * @brief  Reset Wakeup frame filter register pointer.
 */
void ETH_ResetWakeUpFrameFilter(void)
{
    /* Resets the Remote Wake-up Frame Filter register pointer to 0x0000 */
    ETH->MACPMTCTRLSTS |= ETH_MACPMTCTRLSTS_RWKUPFLTRST;
}

/**
 * @brief  Populates the remote wakeup frame registers.
 * @param Buffer Pointer on remote WakeUp Frame Filter Register buffer data (8 words).
 */
void ETH_SetWakeUpFrameFilter(uint32_t* Buffer)
{
    uint32_t i = 0;

    /* Fill Remote Wake-up Frame Filter register with Buffer data */
    for (i = 0; i < ETH_WAKEUP_REG_LEN; i++)
    {
        /* Write each time to the same register */
        ETH->MACRMTWUFRMFLT = Buffer[i];
    }
}

/**
 * @brief  Enables or disables any unicast packet filtered by the MAC address
 *   recognition to be a wake-up frame.
 * @param Cmd new state of the MAC Global Unicast Wake-Up.
 *   This parameter can be: ENABLE or DISABLE.
 */
void ETH_EnableGlobalUnicastWakeUp(FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    if (Cmd != DISABLE)
    {
        /* Enable the MAC Global Unicast Wake-Up */
        ETH->MACPMTCTRLSTS |= ETH_MACPMTCTRLSTS_GLBLUCAST;
    }
    else
    {
        /* Disable the MAC Global Unicast Wake-Up */
        ETH->MACPMTCTRLSTS &= ~ETH_MACPMTCTRLSTS_GLBLUCAST;
    }
}

/**
 * @brief  Checks whether the specified ETHERNET PMT flag is set or not.
 * @param ETH_PMT_FLAG specifies the flag to check.
 *   This parameter can be one of the following values:
 *     @arg ETH_PMT_FLAG_RWKUPFILTRST Wake-Up Frame Filter Register Poniter Reset
 *     @arg ETH_PMT_FLAG_RWKPRCVD Wake-Up Frame Received
 *     @arg ETH_PMT_FLAG_MGKPRCVD Magic Packet Received
 * @return The new state of ETHERNET PMT Flag (SET or RESET).
 */
FlagStatus ETH_GetPmtFlagStatus(uint32_t ETH_PMT_FLAG)
{
    FlagStatus bitstatus = RESET;
    /* Check the parameters */
    assert_param(IS_ETH_PMT_GET_FLAG(ETH_PMT_FLAG));

    if ((ETH->MACPMTCTRLSTS & ETH_PMT_FLAG) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
 * @brief  Enables or disables the MAC Wake-Up Frame Detection.
 * @param Cmd new state of the MAC Wake-Up Frame Detection.
 *   This parameter can be: ENABLE or DISABLE.
 */
void ETH_EnableWakeUpFrameDetection(FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    if (Cmd != DISABLE)
    {
        /* Enable the MAC Wake-Up Frame Detection */
        ETH->MACPMTCTRLSTS |= ETH_MACPMTCTRLSTS_RWKPKTEN;
    }
    else
    {
        /* Disable the MAC Wake-Up Frame Detection */
        ETH->MACPMTCTRLSTS &= ~ETH_MACPMTCTRLSTS_RWKPKTEN;
    }
}

/**
 * @brief  Enables or disables the MAC Magic Packet Detection.
 * @param Cmd new state of the MAC Magic Packet Detection.
 *   This parameter can be: ENABLE or DISABLE.
 */
void ETH_EnableMagicPacketDetection(FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    if (Cmd != DISABLE)
    {
        /* Enable the MAC Magic Packet Detection */
        ETH->MACPMTCTRLSTS |= ETH_MACPMTCTRLSTS_MGKPKTEN;
    }
    else
    {
        /* Disable the MAC Magic Packet Detection */
        ETH->MACPMTCTRLSTS &= ~ETH_MACPMTCTRLSTS_MGKPKTEN;
    }
}

/**
 * @brief  Enables or disables the MAC Power Down.
 * @param Cmd new state of the MAC Power Down.
 *   This parameter can be: ENABLE or DISABLE.
 */
void ETH_EnablePowerDown(FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    if (Cmd != DISABLE)
    {
        /* Enable the MAC Power Down */
        /* This puts the MAC in power down mode */
        ETH->MACPMTCTRLSTS |= ETH_MACPMTCTRLSTS_PWRDWN;
    }
    else
    {
        /* Disable the MAC Power Down */
        ETH->MACPMTCTRLSTS &= ~ETH_MACPMTCTRLSTS_PWRDWN;
    }
}

/*---------------------------------  MMC  ------------------------------------*/
/**
 * @brief  Enables or disables the MMC Counter Freeze.
 * @param Cmd new state of the MMC Counter Freeze.
 *   This parameter can be: ENABLE or DISABLE.
 */
void ETH_EnableMmcCounterFreeze(FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    if (Cmd != DISABLE)
    {
        /* Enable the MMC Counter Freeze */
        ETH->MMCCTRL |= ETH_MMCCTRL_CNTFREEZ;
    }
    else
    {
        /* Disable the MMC Counter Freeze */
        ETH->MMCCTRL &= ~ETH_MMCCTRL_CNTFREEZ;
    }
}

/**
 * @brief  Enables or disables the MMC Reset On Read.
 * @param Cmd new state of the MMC Reset On Read.
 *   This parameter can be: ENABLE or DISABLE.
 */
void ETH_EnableMmcResetOnRead(FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    if (Cmd != DISABLE)
    {
        /* Enable the MMC Counter reset on read */
        ETH->MMCCTRL |= ETH_MMCCTRL_RSTONRD;
    }
    else
    {
        /* Disable the MMC Counter reset on read */
        ETH->MMCCTRL &= ~ETH_MMCCTRL_RSTONRD;
    }
}

/**
 * @brief  Enables or disables the MMC Counter Stop Rollover.
 * @param Cmd new state of the MMC Counter Stop Rollover.
 *   This parameter can be: ENABLE or DISABLE.
 */
void ETH_EnableMmcCounterRollover(FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    if (Cmd != DISABLE)
    {
        /* Disable the MMC Counter Stop Rollover  */
        ETH->MMCCTRL &= ~ETH_MMCCTRL_CNTSTOPRO;
    }
    else
    {
        /* Enable the MMC Counter Stop Rollover */
        ETH->MMCCTRL |= ETH_MMCCTRL_CNTSTOPRO;
    }
}

/**
 * @brief  Resets the MMC Counters.
 */
void ETH_ResetMmcCounters(void)
{
    /* Resets the MMC Counters */
    ETH->MMCCTRL |= ETH_MMCCTRL_CNTRST;
}

/**
 * @brief  Enables or disables the specified ETHERNET MMC interrupts.
 * @param ETH_MMC_IT specifies the ETHERNET MMC interrupt sources to be enabled or disabled.
 *   This parameter can be any combination of Tx interrupt or
 *   any combination of Rx interrupt (but not both)of the following values:
 *     @arg ETH_MMC_INT_TXGFRMIS When Tx good frame counter reaches half the maximum value
 *     @arg ETH_MMC_INT_TXMCOLGFIS When Tx good multi col counter reaches half the maximum value
 *     @arg ETH_MMC_INT_TXSCOLGFIS When Tx good single col counter reaches half the maximum value
 *     @arg ETH_MMC_INT_RXUCGFIS When Rx good unicast frames counter reaches half the maximum value
 *     @arg ETH_MMC_INT_RXALGNERFIS When Rx alignment error counter reaches half the maximum value
 *     @arg ETH_MMC_INT_RXCRCERFIS When Rx crc error counter reaches half the maximum value
 * @param Cmd new state of the specified ETHERNET MMC interrupts.
 *   This parameter can be: ENABLE or DISABLE.
 */
void ETH_EnableMmcInt(uint32_t ETH_MMC_IT, FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_ETH_MMC_INT(ETH_MMC_IT));
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    if ((ETH_MMC_IT & (uint32_t)0x10000000) != (uint32_t)RESET)
    {
        /* Remove egister mak from IT */
        ETH_MMC_IT &= 0xEFFFFFFF;

        /* ETHERNET MMC Rx interrupts selected */
        if (Cmd != DISABLE)
        {
            /* Enable the selected ETHERNET MMC interrupts */
            ETH->MMCRXINTMSK &= (~(uint32_t)ETH_MMC_IT);
        }
        else
        {
            /* Disable the selected ETHERNET MMC interrupts */
            ETH->MMCRXINTMSK |= ETH_MMC_IT;
        }
    }
    else
    {
        /* ETHERNET MMC Tx interrupts selected */
        if (Cmd != DISABLE)
        {
            /* Enable the selected ETHERNET MMC interrupts */
            ETH->MMCTXINTMSK &= (~(uint32_t)ETH_MMC_IT);
        }
        else
        {
            /* Disable the selected ETHERNET MMC interrupts */
            ETH->MMCTXINTMSK |= ETH_MMC_IT;
        }
    }
}

/**
 * @brief  Checks whether the specified ETHERNET MMC IT is set or not.
 * @param ETH_MMC_IT specifies the ETHERNET MMC interrupt.
 *   This parameter can be one of the following values:
 *     @arg ETH_MMC_IT_TxFCGC When Tx good frame counter reaches half the maximum value
 *     @arg ETH_MMC_IT_TxMCGC When Tx good multi col counter reaches half the maximum value
 *     @arg ETH_MMC_IT_TxSCGC When Tx good single col counter reaches half the maximum value
 *     @arg ETH_MMC_IT_RxUGFC When Rx good unicast frames counter reaches half the maximum value
 *     @arg ETH_MMC_IT_RxAEC When Rx alignment error counter reaches half the maximum value
 *     @arg ETH_MMC_IT_RxCEC When Rx crc error counter reaches half the maximum value
 * @return The value of ETHERNET MMC IT (SET or RESET).
 */
INTStatus ETH_GetMmcIntStatus(uint32_t ETH_MMC_IT)
{
    INTStatus bitstatus = RESET;
    /* Check the parameters */
    assert_param(IS_ETH_MMC_GET_INT(ETH_MMC_IT));

    if ((ETH_MMC_IT & (uint32_t)0x10000000) != (uint32_t)RESET)
    {
        /* ETHERNET MMC Rx interrupts selected */
        /* Check if the ETHERNET MMC Rx selected interrupt is enabled and occured */
        if ((((ETH->MMCRXINT & ETH_MMC_IT) != (uint32_t)RESET)) && ((ETH->MMCRXINTMSK & ETH_MMC_IT) != (uint32_t)RESET))
        {
            bitstatus = SET;
        }
        else
        {
            bitstatus = RESET;
        }
    }
    else
    {
        /* ETHERNET MMC Tx interrupts selected */
        /* Check if the ETHERNET MMC Tx selected interrupt is enabled and occured */
        if ((((ETH->MMCTXINT & ETH_MMC_IT) != (uint32_t)RESET)) && ((ETH->MMCRXINTMSK & ETH_MMC_IT) != (uint32_t)RESET))
        {
            bitstatus = SET;
        }
        else
        {
            bitstatus = RESET;
        }
    }

