RT-Thread/rt-thread/bsp/n32g45x/Libraries/n32g45x_std_periph_driver/n32g45x_std_driver/src/n32g45x_eth.c
    return bitstatus;
}

/**
 * @brief  Get the specified ETHERNET MMC register value.
 * @param ETH_MMCReg specifies the ETHERNET MMC register.
 *   This parameter can be one of the following values:
 *     @arg ETH_MMCCTRL MMC CTRL register
 *     @arg ETH_MMCRXINT MMC RIR register
 *     @arg ETH_MMCTXINT MMC TIR register
 *     @arg ETH_MMCRXINTMSK MMC RIMR register
 *     @arg ETH_MMCTXINTMSK MMC TIMR register
 *     @arg ETH_MMCTXGFASCCNT MMC TGFSCCR register
 *     @arg ETH_MMCTXGFAMSCCNT MMC TGFMSCCR register
 *     @arg ETH_MMCTXGFCNT MMC TGFCR register
 *     @arg ETH_MMCRXFCECNT MMC RFCECR register
 *     @arg ETH_MMCRXFAECNT MMC RFAECR register
 *     @arg ETH_MMCRXGUFCNT MMC RGUFCRregister
 * @return The value of ETHERNET MMC Register value.
 */
uint32_t ETH_GetMmcRegisterValue(uint32_t ETH_MMCReg)
{
    /* Check the parameters */
    assert_param(IS_ETH_MMC_REGISTER(ETH_MMCReg));

    /* Return the selected register value */
    return (*(__IO uint32_t*)(ETH_MAC_BASE + ETH_MMCReg));
}
/*---------------------------------  PTP  ------------------------------------*/

/**
 * @brief  Updated the PTP block for fine correction with the Time Stamp Addend register value.
 */
void ETH_UpdatePtpTimeStampAddend(void)
{
    /* Enable the PTP block update with the Time Stamp Addend register value */
    ETH->PTPTSCTRL |= ETH_PTPTSCTRL_TSADDREG;
}

/**
 * @brief  Enable the PTP Time Stamp interrupt trigger
 */
void ETH_EnablePtpTimeStampIntTrigger(void)
{
    /* Enable the PTP target time interrupt */
    ETH->PTPTSCTRL |= ETH_PTPTSCTRL_TSTRIG;
}

/**
 * @brief  Updated the PTP system time with the Time Stamp Update register value.
 */
void ETH_UpdatePtpTimeStamp(void)
{
    /* Enable the PTP system time update with the Time Stamp Update register value */
    ETH->PTPTSCTRL |= ETH_PTPTSCTRL_TSUPDT;
}

/**
 * @brief  Initialize the PTP Time Stamp
 */
void ETH_InitPtpTimeStamp(void)
{
    /* Initialize the PTP Time Stamp */
    ETH->PTPTSCTRL |= ETH_PTPTSCTRL_TSINIT;
}

/**
 * @brief  Selects the PTP Update method
 * @param UpdateMethod the PTP Update method
 *   This parameter can be one of the following values:
 *     @arg ETH_PTP_FINE_UPDATE Fine Update method
 *     @arg ETH_PTP_COARSE_UPDATE Coarse Update method
 */
void ETH_ConfigPtpUpdateMethod(uint32_t UpdateMethod)
{
    /* Check the parameters */
    assert_param(IS_ETH_PTP_UPDATE(UpdateMethod));

    if (UpdateMethod != ETH_PTP_COARSE_UPDATE)
    {
        /* Enable the PTP Fine Update method */
        ETH->PTPTSCTRL |= ETH_PTPTSCTRL_TSCFUPDT;
    }
    else
    {
        /* Disable the PTP Coarse Update method */
        ETH->PTPTSCTRL &= (~(uint32_t)ETH_PTPTSCTRL_TSCFUPDT);
    }
}

/**
 * @brief  Enables or disables the PTP time stamp for transmit and receive frames.
 * @param Cmd new state of the PTP time stamp for transmit and receive frames
 *   This parameter can be: ENABLE or DISABLE.
 */
void ETH_StartPTPTimeStamp(FunctionalState Cmd)
{
    /* Check the parameters */
    assert_param(IS_FUNCTIONAL_STATE(Cmd));

    if (Cmd != DISABLE)
    {
        /* Enable the PTP time stamp for transmit and receive frames */
        ETH->PTPTSCTRL |= ETH_PTPTSCTRL_TSENA;
    }
    else
    {
        /* Disable the PTP time stamp for transmit and receive frames */
        ETH->PTPTSCTRL &= (~(uint32_t)ETH_PTPTSCTRL_TSENA);
    }
}

/**
 * @brief  Checks whether the specified ETHERNET PTP flag is set or not.
 * @param ETH_PTP_FLAG specifies the flag to check.
 *   This parameter can be one of the following values:
 *     @arg ETH_PTP_FLAG_TSADDREG Addend Register Update
 *     @arg ETH_PTP_FLAG_TSTRIG Time Stamp Interrupt Trigger Enable
 *     @arg ETH_PTP_FLAG_TSUPDT Time Stamp Update
 *     @arg ETH_PTP_FLAG_TSINIT Time Stamp Initialize
 * @return The new state of ETHERNET PTP Flag (SET or RESET).
 */
FlagStatus ETH_GetPtpFlagStatus(uint32_t ETH_PTP_FLAG)
{
    FlagStatus bitstatus = RESET;
    /* Check the parameters */
    assert_param(IS_ETH_PTP_GET_FLAG(ETH_PTP_FLAG));

    if ((ETH->PTPTSCTRL & ETH_PTP_FLAG) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
 * @brief  Sets the system time Sub-Second Increment value.
 * @param SubSecondValue specifies the PTP Sub-Second Increment Register value.
 */
void ETH_SetPtpSubSecondInc(uint32_t SubSecondValue)
{
    /* Check the parameters */
    assert_param(IS_ETH_PTP_SUBSECOND_INCREMENT(SubSecondValue));
    /* Set the PTP Sub-Second Increment Register */
    ETH->PTPSSINC = SubSecondValue;
}

/**
 * @brief  Sets the Time Stamp update sign and values.
 * @param Sign specifies the PTP Time update value sign.
 *   This parameter can be one of the following values:
 *     @arg ETH_PTP_POSITIVE_TIME positive time value.
 *     @arg ETH_PTP_NEGATIVE_TIME negative time value.
 * @param SecondValue specifies the PTP Time update second value.
 * @param SubSecondValue specifies the PTP Time update sub-second value.
 *   This parameter is a 31 bit value, bit32 correspond to the sign.
 */
void ETH_SetPtpTimeStampUpdate(uint32_t Sign, uint32_t SecondValue, uint32_t SubSecondValue)
{
    /* Check the parameters */
    assert_param(IS_ETH_PTP_TIME_SIGN(Sign));
    assert_param(IS_ETH_PTP_TIME_STAMP_UPDATE_SUBSECOND(SubSecondValue));
    /* Set the PTP Time Update High Register */
    ETH->PTPSECUP = SecondValue;

    /* Set the PTP Time Update Low Register with sign */
    ETH->PTPNSUP = Sign | SubSecondValue;
}

/**
 * @brief  Sets the Time Stamp Addend value.
 * @param Value specifies the PTP Time Stamp Addend Register value.
 */
void ETH_SetPtpTimeStampAddend(uint32_t Value)
{
    /* Set the PTP Time Stamp Addend Register */
    ETH->PTPTSADD = Value;
}

/**
 * @brief  Sets the Target Time registers values.
 * @param HighValue specifies the PTP Target Time High Register value.
 * @param LowValue specifies the PTP Target Time Low Register value.
 */
void ETH_SetPtpTargetTime(uint32_t HighValue, uint32_t LowValue)
{
    /* Set the PTP Target Time High Register */
    ETH->PTPTTSEC = HighValue;
    /* Set the PTP Target Time Low Register */
    ETH->PTPTTNS = LowValue;
}

/**
 * @brief  Get the specified ETHERNET PTP register value.
 * @param ETH_PTPReg specifies the ETHERNET PTP register.
 *   This parameter can be one of the following values:
 *     @arg ETH_PTPTSCTRL Sub-Second Increment Register
 *     @arg ETH_PTPSSINC Sub-Second Increment Register
 *     @arg ETH_PTPSEC Time Stamp High Register
 *     @arg ETH_PTPNS Time Stamp Low Register
 *     @arg ETH_PTPSECUP Time Stamp High Update Register
 *     @arg ETH_PTPNSUP Time Stamp Low Update Register
 *     @arg ETH_PTPTSADD Time Stamp Addend Register
 *     @arg ETH_PTPTTSEC Target Time High Register
 *     @arg ETH_PTPTTNS Target Time Low Register
 * @return The value of ETHERNET PTP Register value.
 */
uint32_t ETH_GetPtpRegisterValue(uint32_t ETH_PTPReg)
{
    /* Check the parameters */
    assert_param(IS_ETH_PTP_REGISTER(ETH_PTPReg));

    /* Return the selected register value */
    return (*(__IO uint32_t*)(ETH_MAC_BASE + ETH_PTPReg));
}

/**
 * @brief  Initializes the DMA Tx descriptors in chain mode with PTP.
 * @param DMATxDescTab Pointer on the first Tx desc list
 * @param DMAPTPTxDescTab Pointer on the first PTP Tx desc list
 * @param TxBuff Pointer on the first TxBuffer list
 * @param TxBuffCount Number of the used Tx desc in the list
 */
void ETH_ConfigDmaPtpTxDescInChainMode(ETH_DMADescType* DMATxDescTab,
                                       ETH_DMADescType* DMAPTPTxDescTab,
                                       uint8_t* TxBuff,
                                       uint32_t TxBuffCount)
{
    uint32_t i = 0;
    ETH_DMADescType* DMATxDesc;

    /* Set the DMATxDescToSet pointer with the first one of the DMATxDescTab list */
    DMATxDescToSet    = DMATxDescTab;
    DMAPTPTxDescToSet = DMAPTPTxDescTab;
    /* Fill each DMATxDesc descriptor with the right values */
    for (i = 0; i < TxBuffCount; i++)
    {
        /* Get the pointer on the ith member of the Tx Desc list */
        DMATxDesc = DMATxDescTab + i;
        /* Set Second Address Chained bit and enable PTP */
        DMATxDesc->Status        = 0;
        DMATxDesc->CtrlOrBufSize = ETH_DMA_TX_DESC_TCH | ETH_DMA_TX_DESC_TTSE;

